Autodesk.Revit.UI.ContextMenu.AddItem(Autodesk.Revit.UI.MenuItem)
Add an item to the Context Menu.
Remarks:
Use this method to add a specific type of MenuItem object to context menu.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.ContextMenu.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ContextMenu.#ctor
Default constructor
Since:
2025

Autodesk.Revit.UI.ContextMenu
A class that owns context menu items.
Remarks:
There are three types of menu items (Autodesk.Revit.UI.CommandMenuItem,
Autodesk.Revit.UI.SubMenuItem, Autodesk.Revit.UI.SeparatorItem)
that can be added to a ContextMenu object.
Since:
2025